# SetName Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisDisplayStyle..::..SetName Method
AnalysisDisplayStyle Class See Also
---
Set name of analysis display style element.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public void SetName(
	string name
)
```

Visual Basic
---
```text
Public Sub SetName ( _
	name As String _
)
```

Visual C++
---
```text
public:
void SetName(
	String^ name
)
```

# ### Parameters
name
    Type: System..::..String Analysis display style element name to be set.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | name is not unique in document. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
AnalysisDisplayStyle Class
Autodesk.Revit.DB.Analysis Namespace